cfe/Documents/ТранспортнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>ТранспортнаяНакладная</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвтомобильВместимостьВКубическихМетрах</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПеревозки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицензионнаяКарточкаНомер</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицензионнаяКарточкаВид</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассаБрутто</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказчикПеревозки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоверенностьЛицо</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтомобильГосударственныйНомер</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаданиеНаПеревозку</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаданиеНаПеревозку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГосударственныйНомерПрицепа</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдостоверениеСерия</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузополучатель</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетПлательщика</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоотправитель</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Плательщик</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтпустилДолжность</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводДанныхОТоварномСоставе</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыВыводаДанныхОТоварномСоставе</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтветственныеЛицаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтветственныеЛицаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отпустил</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоверенностьВыдана</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассаНетто</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоверенностьНомер</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоверенностьДата</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДоставки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетПеревозчика</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПогрузки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдостоверениеНомер</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетЗаказчикаПеревозки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтомобильМарка</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прицеп</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтомобильТип</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтомобильГрузоподъемностьВТоннах</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицензионнаяКарточкаСерия</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицензионнаяКарточкаРегистрационныйНомер</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДокументыОснования</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументОснование</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cfe/Documents/ТранспортнаяНакладная/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
&Вместо("ПолучитьДанныеДляПечатнойФормыТранспортнаяНакладная")
Функция ВИЛС_ПолучитьДанныеДляПечатнойФормыТранспортнаяНакладная(ТаблицаНакладных)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаНакладных.ТранспортнаяНакладная КАК ТранспортнаяНакладная,
	|	ТаблицаНакладных.ПорядковыйНомер КАК ПорядковыйНомер
	|ПОМЕСТИТЬ ТаблицаТранспортныхНакладныхБезОснований
	|ИЗ
	|	&ТаблицаНакладных КАК ТаблицаНакладных
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТаблицаНакладных.ТранспортнаяНакладная КАК Документ.ТранспортнаяНакладная) КАК ТранспортнаяНакладная,
	|	ТаблицаНакладных.ПорядковыйНомер КАК ПорядковыйНомер,
	|	ТранспортнаяНакладнаяДокументыОснования.ДокументОснование КАК ДокументОснование,
	|	ТранспортнаяНакладнаяДокументыОснования.ДокументОснование.Проведен КАК ДокументОснованиеПроведен,
	|	ТранспортнаяНакладнаяДокументыОснования.НомерСтроки КАК НомерСтрокиВТранспортнойНакладной
	|ПОМЕСТИТЬ ТаблицаТранспортныхНакладных
	|ИЗ
	|	ТаблицаТранспортныхНакладныхБезОснований КАК ТаблицаНакладных
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТранспортнаяНакладная.ДокументыОснования КАК ТранспортнаяНакладнаяДокументыОснования
	|		ПО ТаблицаНакладных.ТранспортнаяНакладная = ТранспортнаяНакладнаяДокументыОснования.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная КАК Ссылка,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Номер КАК Номер,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Дата КАК Дата,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Организация КАК Организация,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Грузополучатель КАК Грузополучатель,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Грузоотправитель КАК Грузоотправитель,	
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.ЗаказчикПеревозки КАК ЗаказчикПеревозки,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.БанковскийСчетЗаказчикаПеревозки КАК БанковскийСчетЗаказчикаПеревозки,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Отпустил КАК Кладовщик,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.ОтпустилДолжность КАК ДолжностьКладовщика,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Перевозчик КАК Перевозчик,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Водитель КАК Водитель,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.ВидПеревозки КАК ВидПеревозки,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.АвтомобильМарка КАК МаркаАвтомобиля,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.АвтомобильГосударственныйНомер КАК ГосНомерАвтомобиля,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.АдресПогрузки КАК ПунктПогрузки,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.АдресДоставки КАК ПунктРазгрузки,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.СрокДоставки КАК СрокДоставки,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.АвтомобильГрузоподъемностьВТоннах КАК ГрузоподъемностьВТоннахАвтомобиля,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.АвтомобильВместимостьВКубическихМетрах КАК ВместимостьВКубическихМетрахАвтомобиля,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.АвтомобильТип КАК ТипАвтомобиля,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.МассаБрутто КАК МассаБрутто,
	|	ТаблицаТранспортныхНакладных.ПорядковыйНомер,
	|	НЕ МИНИМУМ(ТаблицаТранспортныхНакладных.ДокументОснованиеПроведен) КАК ЕстьНепроведенныеДокументыОснования
	|ИЗ
	|	ТаблицаТранспортныхНакладных КАК ТаблицаТранспортныхНакладных
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Номер,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Дата,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Организация,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Грузополучатель,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Грузоотправитель,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.ЗаказчикПеревозки,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.БанковскийСчетЗаказчикаПеревозки,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Отпустил,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.ОтпустилДолжность,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Перевозчик,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.Водитель,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.ВидПеревозки,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.АвтомобильМарка,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.АвтомобильГосударственныйНомер,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.АдресПогрузки,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.АдресДоставки,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.СрокДоставки,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.АвтомобильГрузоподъемностьВТоннах,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.АвтомобильВместимостьВКубическихМетрах,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.АвтомобильТип,
	|	ТаблицаТранспортныхНакладных.ТранспортнаяНакладная.МассаБрутто,
	|	ТаблицаТранспортныхНакладных.ПорядковыйНомер
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТаблицаТранспортныхНакладных.ПорядковыйНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВнутреннийЗапрос.Ссылка,
	|	ВнутреннийЗапрос.ПорядковыйНомер,
	|   ЕСТЬNULL(ВнутреннийЗапрос.КоличествоУпаковок, 0) 	КАК КоличествоУпаковок,      	// begin fix Suetin 20.02.2019 15:49:44
	|   ВнутреннийЗапрос.Упаковка 							КАК Упаковка,                   // end fix Suetin 20.02.2019 15:49:52
	|	ВнутреннийЗапрос.НаименованиеВидаНоменклатуры
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДокументыОснования.ТранспортнаяНакладная КАК Ссылка,
	|		ДокументыОснования.ПорядковыйНомер КАК ПорядковыйНомер,
	|       ЕСТЬNULL(ДокументТовары.КоличествоУпаковок, 0) 	КАК КоличествоУпаковок,      	// begin fix Suetin 20.02.2019 15:49:44
	|       ВЫБОР
	|			КОГДА ДокументТовары.Номенклатура.ИспользоватьУпаковки
	|				ТОГДА ДокументТовары.Упаковка
	|			ИНАЧЕ ДокументТовары.Номенклатура.ЕдиницаИзмерения
	|		КОНЕЦ 	 										КАК Упаковка,                   // end fix Suetin 20.02.2019 15:49:52
	|		ВЫБОР
	|			КОГДА ВидыНоменклатуры.ИспользоватьИндивидуальноеНаименованиеПриПечати
	|				И НЕ ЕСТЬNULL(ВидыНоменклатуры.НаименованиеДляПечати, """") = """"    	// begin fix Suetin 14.02.2019 14:30:35
	|				ТОГДА ЕСТЬNULL(ВидыНоменклатуры.НаименованиеДляПечати, """")
	|			КОГДА НЕ ЕСТЬNULL(ДокументТовары.Номенклатура, """") = """"    
	|				ТОГДА ЕСТЬNULL(ДокументТовары.Номенклатура, """")       				// end fix Suetin 14.02.2019 14:31:46
	|			ИНАЧЕ &НаименованиеДляПечатиВидовНоменклатуры
	|		КОНЕЦ КАК НаименованиеВидаНоменклатуры
	|	ИЗ
	|		ТаблицаТранспортныхНакладных КАК ДокументыОснования
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров.Товары КАК ДокументТовары
	|			ПО ДокументыОснования.ДокументОснование = ДокументТовары.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|			ПО (ВидыНоменклатуры.Ссылка = ДокументТовары.Номенклатура.ВидНоменклатуры)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДокументыОснования.ТранспортнаяНакладная,
	|		ДокументыОснования.ПорядковыйНомер,
	|       ЕСТЬNULL(ДокументТовары.КоличествоУпаковок, 0) 	КАК КоличествоУпаковок,      	// begin fix Suetin 20.02.2019 15:49:44
	|       ВЫБОР
	|			КОГДА ДокументТовары.Номенклатура.ИспользоватьУпаковки
	|				ТОГДА ДокументТовары.Упаковка
	|			ИНАЧЕ ДокументТовары.Номенклатура.ЕдиницаИзмерения
	|		КОНЕЦ 	 										КАК Упаковка,                   // end fix Suetin 20.02.2019 15:49:52
	|		ВЫБОР
	|			КОГДА ВидыНоменклатуры.ИспользоватьИндивидуальноеНаименованиеПриПечати
	|				И НЕ ЕСТЬNULL(ВидыНоменклатуры.НаименованиеДляПечати, """") = """"    	// begin fix Suetin 14.02.2019 14:30:35
	|				ТОГДА ЕСТЬNULL(ВидыНоменклатуры.НаименованиеДляПечати, """")
	|			КОГДА НЕ ЕСТЬNULL(ДокументТовары.Номенклатура, """") = """"    
	|				ТОГДА ЕСТЬNULL(ДокументТовары.Номенклатура, """")       				// end fix Suetin 14.02.2019 14:31:46
	|			ИНАЧЕ &НаименованиеДляПечатиВидовНоменклатуры
	|		КОНЕЦ
	|	ИЗ
	|		ТаблицаТранспортныхНакладных КАК ДокументыОснования
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровПоставщику.Товары КАК ДокументТовары
	|			ПО ДокументыОснования.ДокументОснование = ДокументТовары.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|			ПО (ВидыНоменклатуры.Ссылка = ДокументТовары.Номенклатура.ВидНоменклатуры)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДокументыОснования.ТранспортнаяНакладная,
	|		ДокументыОснования.ПорядковыйНомер,
	|       ЕСТЬNULL(ДокументТовары.КоличествоУпаковок, 0) 	КАК КоличествоУпаковок,      	// begin fix Suetin 20.02.2019 15:49:44
	|       ВЫБОР
	|			КОГДА ДокументТовары.Номенклатура.ИспользоватьУпаковки
	|				ТОГДА ДокументТовары.Упаковка
	|			ИНАЧЕ ДокументТовары.Номенклатура.ЕдиницаИзмерения
	|		КОНЕЦ 	 										КАК Упаковка,                   // end fix Suetin 20.02.2019 15:49:52
	|		ВЫБОР
	|			КОГДА ВидыНоменклатуры.ИспользоватьИндивидуальноеНаименованиеПриПечати
	|				И НЕ ЕСТЬNULL(ВидыНоменклатуры.НаименованиеДляПечати, """") = """"    	// begin fix Suetin 14.02.2019 14:30:35
	|				ТОГДА ЕСТЬNULL(ВидыНоменклатуры.НаименованиеДляПечати, """")
	|			КОГДА НЕ ЕСТЬNULL(ДокументТовары.Номенклатура, """") = """"    
	|				ТОГДА ЕСТЬNULL(ДокументТовары.Номенклатура, """")       				// end fix Suetin 14.02.2019 14:31:46
	|			ИНАЧЕ &НаименованиеДляПечатиВидовНоменклатуры
	|		КОНЕЦ
	|	ИЗ
	|		ТаблицаТранспортныхНакладных КАК ДокументыОснования
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.Товары КАК ДокументТовары
	|			ПО ДокументыОснования.ДокументОснование = ДокументТовары.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|			ПО (ВидыНоменклатуры.Ссылка = ДокументТовары.Номенклатура.ВидНоменклатуры)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
//++ НЕ УТКА
	|	
	|	ВЫБРАТЬ
	|		ДокументыОснования.ТранспортнаяНакладная,
	|		ДокументыОснования.ПорядковыйНомер,
	|       ЕСТЬNULL(ДокументТовары.КоличествоУпаковок, 0) 	КАК КоличествоУпаковок,      	// begin fix Suetin 20.02.2019 15:49:44
	|       ВЫБОР
	|			КОГДА ДокументТовары.Номенклатура.ИспользоватьУпаковки
	|				ТОГДА ДокументТовары.Упаковка
	|			ИНАЧЕ ДокументТовары.Номенклатура.ЕдиницаИзмерения
	|		КОНЕЦ 	 										КАК Упаковка,                   // end fix Suetin 20.02.2019 15:49:52
	|		ВЫБОР
	|			КОГДА ВидыНоменклатуры.ИспользоватьИндивидуальноеНаименованиеПриПечати
	|				И НЕ ЕСТЬNULL(ВидыНоменклатуры.НаименованиеДляПечати, """") = """"    	// begin fix Suetin 14.02.2019 14:30:35
	|				ТОГДА ЕСТЬNULL(ВидыНоменклатуры.НаименованиеДляПечати, """")
	|			КОГДА НЕ ЕСТЬNULL(ДокументТовары.Номенклатура, """") = """"    
	|				ТОГДА ЕСТЬNULL(ДокументТовары.Номенклатура, """")       				// end fix Suetin 14.02.2019 14:31:46
	|			ИНАЧЕ &НаименованиеДляПечатиВидовНоменклатуры
	|		КОНЕЦ
	|	ИЗ
	|		ТаблицаТранспортныхНакладных КАК ДокументыОснования
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПередачаДавальцу.Товары КАК ДокументТовары
	|			ПО ДокументыОснования.ДокументОснование = ДокументТовары.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|			ПО (ВидыНоменклатуры.Ссылка = ДокументТовары.Номенклатура.ВидНоменклатуры)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
//-- НЕ УТКА
//++ НЕ УТ
	|	
	|	ВЫБРАТЬ
	|		ДокументыОснования.ТранспортнаяНакладная,
	|		ДокументыОснования.ПорядковыйНомер,
	|       ЕСТЬNULL(ДокументТовары.КоличествоУпаковок, 0) 	КАК КоличествоУпаковок,      	// begin fix Suetin 20.02.2019 15:49:44
	|       ВЫБОР
	|			КОГДА ДокументТовары.Номенклатура.ИспользоватьУпаковки
	|				ТОГДА ДокументТовары.Упаковка
	|			ИНАЧЕ ДокументТовары.Номенклатура.ЕдиницаИзмерения
	|		КОНЕЦ 	 										КАК Упаковка,                   // end fix Suetin 20.02.2019 15:49:52
	|		ВЫБОР
	|			КОГДА ВидыНоменклатуры.ИспользоватьИндивидуальноеНаименованиеПриПечати
	|				И НЕ ЕСТЬNULL(ВидыНоменклатуры.НаименованиеДляПечати, """") = """"    	// begin fix Suetin 14.02.2019 14:30:35
	|				ТОГДА ЕСТЬNULL(ВидыНоменклатуры.НаименованиеДляПечати, """")
	|			КОГДА НЕ ЕСТЬNULL(ДокументТовары.Номенклатура, """") = """"    
	|				ТОГДА ЕСТЬNULL(ДокументТовары.Номенклатура, """")       				// end fix Suetin 14.02.2019 14:31:46
	|			ИНАЧЕ &НаименованиеДляПечатиВидовНоменклатуры
	|		КОНЕЦ
	|	ИЗ
	|		ТаблицаТранспортныхНакладных КАК ДокументыОснования
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтгрузкаТоваровСХранения.Товары КАК ДокументТовары
	|			ПО ДокументыОснования.ДокументОснование = ДокументТовары.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|			ПО (ВидыНоменклатуры.Ссылка = ДокументТовары.Номенклатура.ВидНоменклатуры)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДокументыОснования.ТранспортнаяНакладная,
	|		ДокументыОснования.ПорядковыйНомер,
	|       ЕСТЬNULL(ДокументТовары.КоличествоУпаковок, 0) 	КАК КоличествоУпаковок,      	// begin fix Suetin 20.02.2019 15:49:44
	|       ВЫБОР
	|			КОГДА ДокументТовары.Номенклатура.ИспользоватьУпаковки
	|				ТОГДА ДокументТовары.Упаковка
	|			ИНАЧЕ ДокументТовары.Номенклатура.ЕдиницаИзмерения
	|		КОНЕЦ 	 										КАК Упаковка,                   // end fix Suetin 20.02.2019 15:49:52
	|		ВЫБОР
	|			КОГДА ВидыНоменклатуры.ИспользоватьИндивидуальноеНаименованиеПриПечати
	|				И НЕ ЕСТЬNULL(ВидыНоменклатуры.НаименованиеДляПечати, """") = """"    	// begin fix Suetin 14.02.2019 14:30:35
	|				ТОГДА ЕСТЬNULL(ВидыНоменклатуры.НаименованиеДляПечати, """")
	|			КОГДА НЕ ЕСТЬNULL(ДокументТовары.Номенклатура, """") = """"    
	|				ТОГДА ЕСТЬNULL(ДокументТовары.Номенклатура, """")       				// end fix Suetin 14.02.2019 14:31:46
	|			ИНАЧЕ &НаименованиеДляПечатиВидовНоменклатуры
	|		КОНЕЦ
	|	ИЗ
	|		ТаблицаТранспортныхНакладных КАК ДокументыОснования
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПередачаСырьяПереработчику.Товары КАК ДокументТовары
	|			ПО ДокументыОснования.ДокументОснование = ДокументТовары.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|			ПО (ВидыНоменклатуры.Ссылка = ДокументТовары.Номенклатура.ВидНоменклатуры)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
//-- НЕ УТ
//++ НЕ УТКА
	|	
	|	ВЫБРАТЬ
	|		ДокументыОснования.ТранспортнаяНакладная,
	|		ДокументыОснования.ПорядковыйНомер,
	|       ЕСТЬNULL(ДокументТовары.КоличествоУпаковок, 0) 	КАК КоличествоУпаковок,      	// begin fix Suetin 20.02.2019 15:49:44
	|       ВЫБОР
	|			КОГДА ДокументТовары.Номенклатура.ИспользоватьУпаковки
	|				ТОГДА ДокументТовары.Упаковка
	|			ИНАЧЕ ДокументТовары.Номенклатура.ЕдиницаИзмерения
	|		КОНЕЦ 	 										КАК Упаковка,                   // end fix Suetin 20.02.2019 15:49:52
	|		ВЫБОР
	|			КОГДА ВидыНоменклатуры.ИспользоватьИндивидуальноеНаименованиеПриПечати
	|				И НЕ ЕСТЬNULL(ВидыНоменклатуры.НаименованиеДляПечати, """") = """"    	// begin fix Suetin 14.02.2019 14:30:35
	|				ТОГДА ЕСТЬNULL(ВидыНоменклатуры.НаименованиеДляПечати, """")
	|			КОГДА НЕ ЕСТЬNULL(ДокументТовары.Номенклатура, """") = """"    
	|				ТОГДА ЕСТЬNULL(ДокументТовары.Номенклатура, """")       				// end fix Suetin 14.02.2019 14:31:46
	|			ИНАЧЕ &НаименованиеДляПечатиВидовНоменклатуры
	|		КОНЕЦ
	|	ИЗ
	|		ТаблицаТранспортныхНакладных КАК ДокументыОснования
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратСырьяДавальцу.Товары КАК ДокументТовары
	|			ПО ДокументыОснования.ДокументОснование = ДокументТовары.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|			ПО (ВидыНоменклатуры.Ссылка = ДокументТовары.Номенклатура.ВидНоменклатуры)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
//-- НЕ УТКА
	|
	|	ВЫБРАТЬ
	|		ДокументыОснования.ТранспортнаяНакладная,
	|		ДокументыОснования.ПорядковыйНомер,
	|       ЕСТЬNULL(ДокументТовары.КоличествоУпаковок, 0) 	КАК КоличествоУпаковок,      	// begin fix Suetin 20.02.2019 15:49:44
	|       ВЫБОР
	|			КОГДА ДокументТовары.Номенклатура.ИспользоватьУпаковки
	|				ТОГДА ДокументТовары.Упаковка
	|			ИНАЧЕ ДокументТовары.Номенклатура.ЕдиницаИзмерения
	|		КОНЕЦ 	 										КАК Упаковка,                   // end fix Suetin 20.02.2019 15:49:52
	|		ВЫБОР
	|			КОГДА ВидыНоменклатуры.ИспользоватьИндивидуальноеНаименованиеПриПечати
	|				И НЕ ЕСТЬNULL(ВидыНоменклатуры.НаименованиеДляПечати, """") = """"    	// begin fix Suetin 14.02.2019 14:30:35
	|				ТОГДА ЕСТЬNULL(ВидыНоменклатуры.НаименованиеДляПечати, """")
	|			КОГДА НЕ ЕСТЬNULL(ДокументТовары.Номенклатура, """") = """"    
	|				ТОГДА ЕСТЬNULL(ДокументТовары.Номенклатура, """")       				// end fix Suetin 14.02.2019 14:31:46
	|			ИНАЧЕ &НаименованиеДляПечатиВидовНоменклатуры
	|		КОНЕЦ
	|	ИЗ
	|		ТаблицаТранспортныхНакладных КАК ДокументыОснования
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК ДокументТовары
	|			ПО ДокументыОснования.ДокументОснование = ДокументТовары.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|			ПО (ВидыНоменклатуры.Ссылка = ДокументТовары.Номенклатура.ВидНоменклатуры)) КАК ВнутреннийЗапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВнутреннийЗапрос.ПорядковыйНомер,
	|	ВнутреннийЗапрос.НаименованиеВидаНоменклатуры
	// begin fix Suetin 14.02.2019 11:59:58
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТТН.ТранспортнаяНакладная 				КАК ТранспортнаяНакладная,
	|	ТТН.ТранспортнаяНакладная.Руководитель 	КАК Руководитель,
	|	ТТН.ПорядковыйНомер 					КАК ПорядковыйНомер,
	|	ТТН.ДокументОснование 					КАК ДокументОснование,
	|	ТТН.ДокументОснованиеПроведен 			КАК ДокументОснованиеПроведен,
	|	ТТН.ДокументОснование.Номер 			КАК Номер,
	|	ТТН.ДокументОснование.Дата 				КАК Дата
	|ИЗ
	|	ТаблицаТранспортныхНакладных КАК ТТН
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТТН.ПорядковыйНомер
	|";
	// end fix Suetin 14.02.2019 12:00:09
	Запрос.УстановитьПараметр("ТаблицаНакладных", ТаблицаНакладных);
	Запрос.УстановитьПараметр("НаименованиеДляПечатиВидовНоменклатуры", Константы.НаименованиеДляПечатиВидовНоменклатуры.Получить());
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("ТаблицаРезультата", РезультатЗапроса[2].Выгрузить());
	СтруктураРезультата.Вставить("РезультатИменаТоваров", РезультатЗапроса[3]);
	// begin fix Suetin 14.02.2019 12:05:32	
	СтруктураРезультата.Вставить("ТаблицаНомеровДокументов", РезультатЗапроса[4]);
	// end fix Suetin 14.02.2019 12:05:40	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СтруктураРезультата
	
КонецФункции
#КонецЕсли
